#Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

a = float(input('Введите трёхзначное число a: '))
b = float(input('Введите трёхзначное число b: '))
c = a + b
print('Сумма чисел a и b = {}'.format(c))
d = a * b
print('Произведение чисел a и b = {}'.format(d))